export const chap = `
<a id="s1">1. அல்ஃபாத்திஹா</a>
<a id="s2">2. அல்பகறா</a>
<a id="s3">3. ஆலுஇம்ரான்</a>
<a id="s4">4. அன்னிஸா</a>
<a id="s5">5. அல்மாயிதா</a>
<a id="s6">6. அல்அன்ஆம்</a>
<a id="s7">7. அல்அஃராஃப்</a>
<a id="s8">8. அல்அன்ஃபால்</a>
<a id="s9">9. அத்தவ்பா</a>
<a id="s10">10. யூனுஸ்</a>
<a id="s11">11. ஹூத்</a>
<a id="s12">12. யூஸஃப்</a>
<a id="s13">13. அர்ரஃத்</a>
<a id="s14">14. இப்ராஹீம்</a>
<a id="s15">15. அல்ஹிஜ்ர்</a>
<a id="s16">16. அந்நஹ்ல்</a>
<a id="s17">17. பனூ இஸ்ராயீல்</a>
<a id="s18">18. அல் கஹ்ஃபு</a>
<a id="s19">19. மர்யம்</a>
<a id="s20">20. தாஹா</a>
<a id="s21">21. அல் அன்பியா</a>
<a id="s22">22. அல்ஹஜ்</a>
<a id="s23">23. அல்முஃமினூன்</a>
<a id="s24">24. அந்நூர்</a>
<a id="s25">25. அல் ஃபுர்கான்</a>
<a id="s26">26. அஷ்ஷூஅரா</a>
<a id="s27">27. அந்நம்ல்</a>
<a id="s28">28. அல்கஸஸ்</a>
<a id="s29">29. அல்அன்கபூத்</a>
<a id="s30">30. அர் ரூம்</a>
<a id="s31">31. லுக்மான்</a>
<a id="s32">32. அஸ்ஸஜ்தா</a>
<a id="s33">33. அல்அஹ்ஸாப்</a>
<a id="s34">34. ஸபா</a>
<a id="s35">35. ஃபாத்திர்</a>
<a id="s36">36. யாஸீன்</a>
<a id="s37">37. அஸ்ஸாஃப்ஃபாத்</a>
<a id="s38">38. ஸாத்</a>
<a id="s39">39. அஸ்ஸூمر</a>
<a id="s40">40. அல்முஃமின்</a>
<a id="s41">41. ஹாமீம் ஸஜ்தா</a>
<a id="s42">42. அஷ்ஷூறா</a>
<a id="s43">43. அஸ்ஸூக்ருஃப்</a>
<a id="s44">44. அத்துகான்</a>
<a id="s45">45. அல் ஜாஸியா </a>
<a id="s46">46. அல்அஹ்காஃப்</a>
<a id="s47">47. முஹம்மத்</a>
<a id="s48">48. அல் ஃபத்ஹ் </a>
<a id="s49">49. அல்ஹுஜுராத்</a>
<a id="s50">50. காஃப்</a>
<a id="s51">51. அஸ்ஸாரியாத்</a>
<a id="s52">52. அத்தூர்</a>
<a id="s53">53. அந்நஜ்ம்</a>
<a id="s54">54. அல்கமர்</a>
<a id="s55">55. அர்ரஹ்மான்</a>
<a id="s56">56. அல்வாகிஆ</a>
<a id="s57">57. அல்ஹதீத்</a>
<a id="s58">58. அல்முஜாதலா</a>
<a id="s59">59. அல்ஹஷ்ர்</a>
<a id="s60">60. அல்மும்தஹினா</a>
<a id="s61">61. அஸ்ஸஃப்</a>
<a id="s62">62. அல்ஜுமுஆ</a>
<a id="s63">63. அல்முناஃபிஃகூன்</a>
<a id="s64">64. அத்தகாபுن</a>
<a id="s65">65. அத்தலாஃக்</a>
<a id="s66">66. அத்தஹ்ரீம்</a>
<a id="s67">67. அல்முல்க்</a>
<a id="s68">68. அல்கலம்</a>
<a id="s69">69. அல்ஹாக்கா</a>
<a id="s70">70. அல்மஆரிஜ்</a>
<a id="s71">71. நூஹ்</a>
<a id="s72">72. அல்ஜின்னு</a>
<a id="s73">73. அல்முஸ்ஸம்மில்</a>
<a id="s74">74. அல்முثஸ்ஸிர்</a>
<a id="s75">75. அல்கியாமா</a>
<a id="s76">76. அத்தஹ்ர்</a>
<a id="s77">77. அல்முர்ஸலாத்</a>
<a id="s78">78. அந்நபா</a>
<a id="s79">79. அந்நாஸிஆத்</a>
<a id="s80">80. அபஸ</a>
<a id="s81">81. அத்தக்வீர்</a>
<a id="s82">82. அல்இன்ஃபிதார்</a>
<a id="s83">83. அல்முத்தஃப்ஃபிஃபீன்</a>
<a id="s84">84. அல்இன்ஷிகாக்</a>
<a id="s85">85. அல்புரூஜ்</a>
<a id="s86">86. அத்தாரிக்</a>
<a id="s87">87. அல்அஃலா</a>
<a id="s88">88. அல்காஷியா</a>
<a id="s89">89. அல்ஃபஜ்ர்</a>
<a id="s90">90. அல்பலத் </a>
<a id="s91">91. அஷ்ஷம்ஸ்</a>
<a id="s92">92. அல்லைல்</a>
<a id="s93">93. அள்ளுஹா</a>
<a id="s94">94. அலம் நஷ்ரஹ் </a>
<a id="s95">95. அத்தீன்</a>
<a id="s96">96. அல்அலக்</a>
<a id="s97">97. அல்கத்ர்</a>
<a id="s98">98. அல்பய்யினா</a>
<a id="s99">99. அஸ்ஸில்ஸால்</a>
<a id="s100">100. அல்ஆதியாத்</a>
<a id="s101">101. அல்காரிஆ</a>
<a id="s102">102. அத்தகாஸுர்</a>
<a id="s103">103. அல்அஸ்ர்</a>
<a id="s104">104. அல்ஹுமஸா</a>
<a id="s105">105. அல்ஃபீல்</a>
<a id="s106">106. குறைஷ்</a>
<a id="s107">107. அல்மாஊன்</a>
<a id="s108">108. அல்கவ்ஸர்</a>
<a id="s109">109. அல்காஃபிரூன்</a>
<a id="s110">110. அந் நஸ்ர்</a>
<a id="s111">111. அல்லஹப்</a>
<a id="s112">112. அல்இக்லாஸ்</a>
<a id="s113">113. அல்ஃபலக்</a>
<a id="s114">114. அந்நாஸ்</a>
`;

const s1 = [1 , 8] ;

const s2 = [1, 8, 21, 30, 40, 47, 60, 62, 72, 83,
	87, 97, 104, 113, 122, 130, 142, 148, 152, 164, 
	168, 177, 183, 189, 197, 211, 217, 222, 229, 232,
	236, 243, 249, 254, 258, 261, 267, 274, 282, 284, 287];

const s3 = [1, 10, 21, 31, 42, 55, 64, 72, 81, 92,
	102, 110, 121, 130, 144, 149, 156, 173, 181, 188 , 201] ;

const s4 = [1, 11, 15, 23, 26, 34, 43, 51, 57, 71,
	77, 88, 92, 97, 101, 105, 113, 116, 127, 135 ,
	142, 153, 163, 172 , 177] ;

const s5 = [1, 6, 12, 20, 27, 35, 44, 51, 57, 67,
	78, 87, 99, 101, 109, 116 , 121] ;

const s6 = [1, 11, 21, 31, 41, 51, 56, 61, 71, 83,
	91, 95, 101, 111, 122, 130, 141, 145, 151, 155 , 166] ;

const s7 = [1, 11, 26, 32, 40, 48, 54, 59, 65, 73,
	85, 94, 100, 109, 127, 130, 142, 148, 152, 158,
	163, 172, 182, 189 , 207] ;

const s8 = [1, 11, 20, 29, 38, 45, 49, 59, 65, 70, 76] ;

const s9 = [1, 11, 17, 25, 30, 38, 43, 60, 67, 73, 
	 81, 90, 100, 111, 119, 123, 130] ;

const s10 = [1, 11, 21, 31, 41, 54, 61, 71, 83, 93,
	104, 110] ;

const s11 = [1, 9, 25, 36, 50, 61, 69, 84, 96, 110, 124] ;

const s12 = [1, 7, 21, 30, 36, 43, 50, 58, 69, 80,
	94, 105, 112] ;

const s13 = [1, 8, 19, 27, 32, 38, 44] ;

const s14 = [1, 7, 13, 22, 28, 35, 42, 53] ;

const s15 = [1, 16, 26, 45, 61, 80, 100] ;

const s16 = [1, 10, 22, 26, 35, 41, 51, 61, 66, 71, 
	77, 84, 90, 101, 111, 120, 129] ;

const s17 = [1, 11, 23, 31, 41, 53, 61, 71, 78, 85,
	94, 101, 112] ;

const s18 = [1, 13, 18, 23, 32, 45, 50, 54, 60, 71,
	83, 102, 111] ;

const s19 = [1, 16, 41, 51, 66, 83, 99] ;

const s20 = [1, 25, 55, 77, 90, 105, 116, 129, 136] ;

const s21 = [1, 11, 30, 42, 51, 76, 94, 113] ;

const s22 = [1, 11, 23, 26, 34, 39, 49, 58, 65, 73, 79] ;

const s23 = [1, 23, 33, 51, 78, 93, 119] ;

const s24 = [1, 11, 21, 27, 35, 41, 51, 58, 62, 65] ;

const s25 = [1, 10, 21, 35, 45, 61, 78] ;

const s26 = [1, 10, 34, 52, 69, 105, 123, 141, 160, 176,
	192, 228] ;

const s27 = [1, 15, 32, 45, 59, 67, 83, 94] ;

const s28 = [1, 14, 22, 29, 43, 51, 61, 76, 83, 89] ;

const s29 = [1, 14, 23, 31, 45, 52, 64, 70] ;

const s30 = [1, 11, 20, 28, 41, 54, 61] ;

const s31 = [1, 12, 20, 31, 35] ;

const s32 = [1, 12, 23, 31] ;

const s33 = [1, 9, 21, 28, 35, 41, 53, 59, 69, 74] ;

const s34 = [1, 12, 22, 31, 37, 46, 55] ;

const s35 = [1, 8, 15, 27, 38, 46] ;

const s36 = [1, 13, 33, 51, 68, 84] ;

const s37 = [1, 22, 75, 114, 139, 183] ;

const s38 = [1, 15, 27, 41, 65, 89] ;

const s39 = [1, 10, 22, 32, 42, 53, 64, 71, 76] ;

const s40 = [1, 10, 21, 28, 38, 51, 61, 69, 79, 86] ;

const s41 = [1, 9, 19, 26, 33, 45, 55] ;

const s42 = [1, 10, 20, 30,  54] ;

const s43 = [1, 16, 26, 36, 46, 57, 68, 90] ;

const s44 = [1, 30, 43, 60] ;

const s45 = [1, 12, 22, 27, 38] ;

const s46 = [1, 11, 21, 27, 36] ;

const s47 = [1, 12, 20, 29, 39] ;

const s48 = [1, 11, 18, 27, 30] ;

const s49 = [1, 11, 19] ;

const s50 = [1, 16, 30, 46] ;

const s51 = [1, 24, 47, 61] ;

const s52 = [1, 28, 50] ;

const s53 = [1, 26, 33, 63] ;

const s54 = [1, 23, 41, 56] ;

const s55 = [1, 26, 46, 79] ;

const s56 = [1, 39, 75, 97] ;

const s57 = [1, 11, 20, 26, 30] ;

const s58 = [1, 7, 14, 23] ;

const s59 = [1, 11, 18, 25] ;

const s60 = [1, 14] ;

const s61 = [1, 10, 15] ;

const s62 = [1, 9, 12] ;

const s63 = [1, 9, 12] ;

const s64 = [1, 11, 19] ;

const s65 = [1, 8, 13] ;

const s66 = [1, 8, 13] ;

const s67 = [1, 15, 31] ;

const s68 = [1, 34, 53] ;

const s69 = [1, 38, 53] ;

const s70 = [1, 36, 45] ;

const s71 = [1, 21, 29] ;

const s72 = [1, 20, 29] ;

const s73 = [1, 19, 21] ;

const s74 = [1, 32, 57] ;

const s75 = [1, 31, 41] ;

const s76 = [1, 23, 32] ;

const s77 = [1, 41, 51] ;

const s78 = [1, 31, 41] ;

const s79 = [1, 27, 47] ;

const s80 = [1, 43] ;

const s81 = [1, 30] ;

const s82 = [1, 20] ;

const s83 = [1, 37] ;

const s84 = [1, 26] ;

const s85 = [1, 23] ;

const s86 = [1, 18] ;

const s87 = [1, 20] ;

const s88 = [1, 27] ;

const s89 = [1, 31] ;

const s90 = [1, 21] ;

const s91 = [1, 16] ;

const s92 = [1, 22] ;

const s93 = [1, 12] ;

const s94 = [1, 9] ;

const s95 = [1, 9] ;

const s96 = [1, 20] ;

const s97 = [1, 6] ;

const s98 = [1, 9] ;

const s99 = [1, 9] ;

const s100 = [1, 12] ;

const s101 = [1, 12] ;

const s102 = [1, 9] ;

const s103 = [1, 4] ;

const s104 = [1, 10] ;

const s105 = [1, 6] ;

const s106 = [1, 5] ;

const s107 = [1, 8] ;

const s108 = [1, 4] ;

const s109 = [1, 7] ;

const s110 = [1, 4] ;

const s111 = [1, 6] ;

const s112 = [1, 5] ;

const s113 = [1, 6] ;

const s114 = [1, 7] ;


export const suraVerseRanges = {
  1: s1,
  2: s2,
  3: s3,
  4: s4,
  5: s5,
  6: s6,
  7: s7,
  8: s8,
  9: s9,
  10: s10,
  11: s11,
  12: s12,
  13: s13,
  14: s14,
  15: s15,
  16: s16,
  17: s17,
  18: s18,
  19: s19,
  20: s20,
  21: s21,
  22: s22,
  23: s23,
  24: s24,
  25: s25,
  26: s26,
  27: s27,
  28: s28,
  29: s29,
  30: s30,
  31: s31,
  32: s32,
  33: s33,
  34: s34,
  35: s35,
  36: s36,
  37: s37,
  38: s38,
  39: s39,
  40: s40,
  41: s41,
  42: s42,
  43: s43,
  44: s44,
  45: s45,
  46: s46,
  47: s47,
  48: s48,
  49: s49,
  50: s50,
  51: s51,
  52: s52,
  53: s53,
  54: s54,
  55: s55,
  56: s56,
  57: s57,
  58: s58,
  59: s59,
  60: s60,
  61: s61,
  62: s62,
  63: s63,
  64: s64,
  65: s65,
  66: s66,
  67: s67,
  68: s68,
  69: s69,
  70: s70,
  71: s71,
  72: s72,
  73: s73,
  74: s74,
  75: s75,
  76: s76,
  77: s77,
  78: s78,
  79: s79,
  80: s80,
  81: s81,
  82: s82,
  83: s83,
  84: s84,
  85: s85,
  86: s86,
  87: s87,
  88: s88,
  89: s89,
  90: s90,
  91: s91,
  92: s92,
  93: s93,
  94: s94,
  95: s95,
  96: s96,
  97: s97,
  98: s98,
  99: s99,
  100: s100,
  101: s101,
  102: s102,
  103: s103,
  104: s104,
  105: s105,
  106: s106,
  107: s107,
  108: s108,
  109: s109,
  110: s110,
  111: s111,
  112: s112,
  113: s113,
  114: s114,
};
